app/views/items/_form.html.erb

SELECT "categories".* FROM "categories"
---
		<%= label_tag :category %>
		<%= collection_select :item, :category_id, Category.all, :id, :name, {}, {class:'dropdown-toggle form-control'} %>

SELECT "merchants".* FROM "merchants"
---
		<%= label_tag :merchant %>
		<%= collection_select :item, :merchant_id, Merchant.all, :id, :name, {}, {class:'dropdown-toggle form-control'} %>