app/controllers/categories_controller.rb

SELECT "memberships"."wishlist_id" FROM "memberships" WHERE "memberships"."user_id" = 3 AND "memberships"."contributor" = 't'
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 53 LIMIT 1
---
	def show
		this_user_id = session[:user_id]
		wishlist_ids = Membership.where(:user_id => this_user_id).where(:contributor=>true).pluck(:wishlist_id)
		@wishlists = Wishlist.where(:id => wishlist_ids)
		category_id = params[:id]
		@category = Category.find_by(:id => category_id)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 53 LIMIT 1
---
	def edit
		this_category_id = params[:id]
		@category = Category.find_by(:id => this_category_id)