app/controllers/pages_controller.rb

	def home
		@categories = Category.all
		@merchants = Merchant.all
		@items = Item.all.order('created_at desc').limit(12)
		this_user_id = session[:user_id]
		@user = User.find_by(:id => this_user_id)
---
SELECT "categories".* FROM "categories"
SELECT "merchants".* FROM "merchants"
SELECT "items".* FROM "items" ORDER BY created_at desc LIMIT 12
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1